{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|pad|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<|startoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<|audio_bos|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<|audio_eos|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "NFC"
  },
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": true,
    "ignore_merges": false,
    "vocab": {
      "<|pad|>": 0,
      "<|startoftext|>": 1,
      "<|endoftext|>": 2,
      "<|audio_bos|>": 3,
      "<|audio_eos|>": 4,
      "!": 5,
      "\"": 6,
      "#": 7,
      "$": 8,
      "%": 9,
      "&": 10,
      "'": 11,
      "(": 12,
      ")": 13,
      "*": 14,
      "+": 15,
      ",": 16,
      "-": 17,
      ".": 18,
      "/": 19,
      "0": 20,
      "1": 21,
      "2": 22,
      "3": 23,
      "4": 24,
      "5": 25,
      "6": 26,
      "7": 27,
      "8": 28,
      "9": 29,
      ":": 30,
      ";": 31,
      "<": 32,
      "=": 33,
      ">": 34,
      "?": 35,
      "@": 36,
      "A": 37,
      "B": 38,
      "C": 39,
      "D": 40,
      "E": 41,
      "F": 42,
      "G": 43,
      "H": 44,
      "I": 45,
      "J": 46,
      "K": 47,
      "L": 48,
      "M": 49,
      "N": 50,
      "O": 51,
      "P": 52,
      "Q": 53,
      "R": 54,
      "S": 55,
      "T": 56,
      "U": 57,
      "V": 58,
      "W": 59,
      "X": 60,
      "Y": 61,
      "Z": 62,
      "[": 63,
      "\\": 64,
      "]": 65,
      "^": 66,
      "_": 67,
      "`": 68,
      "a": 69,
      "b": 70,
      "c": 71,
      "d": 72,
      "e": 73,
      "f": 74,
      "g": 75,
      "h": 76,
      "i": 77,
      "j": 78,
      "k": 79,
      "l": 80,
      "m": 81,
      "n": 82,
      "o": 83,
      "p": 84,
      "q": 85,
      "r": 86,
      "s": 87,
      "t": 88,
      "u": 89,
      "v": 90,
      "w": 91,
      "x": 92,
      "y": 93,
      "z": 94,
      "{": 95,
      "|": 96,
      "}": 97,
      "~": 98,
      "Ġ": 99,
      "Ċ": 100,
      "he": 101,
      "ll": 102,
      "lo": 103,
      "wo": 104,
      "or": 105,
      "rl": 106,
      "ld": 107,
      "hel": 108,
      "hell": 109,
      "hello": 110,
      "wor": 111,
      "worl": 112,
      "world": 113,
      "Ġh": 114,
      "Ġhe": 115,
      "Ġhel": 116,
      "Ġhell": 117,
      "Ġhello": 118,
      "Ġw": 119,
      "Ġwo": 120,
      "Ġwor": 121,
      "Ġworl": 122,
      "Ġworld": 123,
      "He": 124,
      "Hel": 125,
      "Hell": 126,
      "Hello": 127,
      "Wo": 128,
      "Wor": 129,
      "Worl": 130,
      "World": 131,
      "ĠH": 132,
      "ĠHe": 133,
      "ĠHel": 134,
      "ĠHell": 135,
      "ĠHello": 136,
      "ĠW": 137,
      "ĠWo": 138,
      "ĠWor": 139,
      "ĠWorl": 140,
      "ĠWorld": 141
    },
    "merges": [
      "h e",
      "l l",
      "l o",
      "w o",
      "o r",
      "r l",
      "l d",
      "he l",
      "hel l",
      "hell o",
      "wo r",
      "wor l",
      "worl d",
      "Ġ h",
      "Ġh e",
      "Ġhe l",
      "Ġhel l",
      "Ġhell o",
      "Ġ w",
      "Ġw o",
      "Ġwo r",
      "Ġwor l",
      "Ġworl d",
      "H e",
      "He l",
      "Hel l",
      "Hell o",
      "W o",
      "Wo r",
      "Wor l",
      "Worl d",
      "Ġ H",
      "ĠH e",
      "ĠHe l",
      "ĠHel l",
      "ĠHell o",
      "Ġ W",
      "ĠW o",
      "ĠWo r",
      "ĠWor l",
      "ĠWorl d"
    ]
  }
}
